
## :white_check_mark: Apply Succeeded (terraform/settings)

[CI link](https://github.com/air-hand/dotfiles/actions/runs/8399565113)



<pre><code>Apply complete! Resources: 1 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
data.github_repository.current: Reading...
data.github_repository.current: Read complete after 1s [id=dotfiles]
github_branch_protection.main: Refreshing state... [id=BPR_kwDOI-MFls4CWO3H]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_actions_variable.tf_cloud_workspace will be created
  + resource "github_actions_variable" "tf_cloud_workspace" {
      + created_at    = (known after apply)
      + id            = (known after apply)
      + repository    = "dotfiles"
      + updated_at    = (known after apply)
      + value         = "dotfiles"
      + variable_name = "TF_CLOUD_WORKSPACE"
    }

Plan: 1 to add, 0 to change, 0 to destroy.
github_actions_variable.tf_cloud_workspace: Creating...
github_actions_variable.tf_cloud_workspace: Creation complete after 1s [id=dotfiles:TF_CLOUD_WORKSPACE]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":75,"Program":"tfcmt","SHA1":"8bcbfb3207da8c93d6c8bffbe764498d6d12e94c","Target":"terraform/settings","Vars":{},"WorkflowName":"Terraform plan and apply"} -->